RATIOS_LENGTH = {'mm': 0.001, 'cm': 0.01, 'km': 1000}
RATIOS_MASS = {'kg': 1000}
MASS = ['g', 'kg']
LENGTH = ['m', 'mm', 'cm', 'km']
TEMPERATURE = ['c', 'k', 'f']
ERR_BELOW0 = 'Температура ниже абсолютного нуля'
ERR_3OPERS = """
Разрешены сложение (+), вычитание (-) для чисел со знаком
(унарной операцией + или -). Не могут идти подряд более 3-х знаков + или -"""
ERR_STARTNUM = 'Выражение должно начинаться с корректного числа со знаком'
ERR_BLANK = "Дано пустое выражение"
ERR_INVALID = "Недопустимый символ: "
ERR_MISSING_OPER = "Пропущен бинарный оператор между: "
ERR_2BINARY = "Два бинарных оператора подряд: "
ERR_BANNED = "Нарушена форма записи операнда или оператора: "
ERR_DIV_BY_0 = "Деление на 0"
ERR_CONV = "Перевод из {} в {} невозможен или нереализован"
ERR_NOT_EXIST = "Такой единицы измерения не существует: "
